Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: *link* allows you to make hard links (using :func:`os.link`) or symbolic links (using :func:`os.symlink`) instead of copying: set it to ``'hard'`` or ``'sym'``; if it is ``None`` (the default), files are copied. Don't set *link* on systems that don't support it: :func:`copy_file` doesn't check if hard or symbolic linking is available. It uses :func:`_copy_file_contents` to copy file contents.
pl: *link* pozwala tworzyć sztywne połączenia (używając :func:`os.link`) lub symboliczne linki (używając :func:`os.symlink`) zamiast kopiowania: ustaw je na ``'hard'`` lub ``'sym'``. jeśli jest ``None`` (domyślnie) pliki są kopiowane. Nie ustawiaj *link*-ów na systemach które nie wspierają ich: :func:`copy_file` nie sprawdza czy twarde lub symboliczne połączenia są dostępne. Używa :func:`_copy_file_contents` do skopiowania zawartości.

source: Return a tuple ``(dest_name, copied)``: *dest_name* is the actual name of the output file, and *copied* is true if the file was copied (or would have been copied, if *dry_run* true).
pl: Zwróć krotkę ``(dest_name, copied)``: *dest_name* jest faktyczną nazwą pliku wynikowego, i *kopiowane* ( - z ang. - *copied*) jest prawdziwe, jeśli plik został skopiowany (lub mógłby był być skopiowany, gdyby *dry_run* było prawdziwe).

source: Move file *src* to *dst*. If *dst* is a directory, the file will be moved into it with the same name; otherwise, *src* is just renamed to *dst*. Returns the new full name of the file.
pl: Przenieś *src* do *dst*. Jeśli *dst* jest katalogiem, plik zostanie przeniesiony do niego z tą samą nazwą; w przeciwnym przypadku, nazwa *src* zwyczajnie jest zmieniana na *dst*. Zwracana jest nowa pełna nazwa pliku.

source: Handles cross-device moves on Unix using :func:`copy_file`. What about other systems?
pl: Obsługuje przenoszenie pomiędzy urządzeniami na Unixie przy użyciu :func:`copy_file`. Co z innymi systemami?

source: Create a file called *filename* and write *contents* (a sequence of strings without line terminators) to it.
pl: Stwórz plik nazwany *filename* i zapisz *zawartość* (sekwencje ciągów znaków bez końców linii) do niego.

source: :mod:`distutils.util` --- Miscellaneous other utility functions
pl: :mod:`distutils.util` --- Różnorakie inne zadania użytkowe

source: This module contains other assorted bits and pieces that don't fit into any other utility module.
pl: Ten moduł zawiera inne różności które nie pasują do innych modułów użytkowych.

source: Return a string that identifies the current platform. This is used mainly to distinguish platform-specific build directories and platform-specific built distributions. Typically includes the OS name and version and the architecture (as supplied by 'os.uname()'), although the exact information included depends on the OS; eg. for IRIX the architecture isn't particularly important (IRIX only runs on SGI hardware), but for Linux the kernel version isn't particularly important.
pl: Zwróć ciąg, który identyfikuje obecną maszynę/środowisko. To jest używane głównie do odróżnienia szczególne dla maszyny/środowiska katalogi budowania i szczególne dla maszyny/środowiska zbudowane pakiety dystrybucyjne. Typowo zawiera nazwę systemu operacyjnego i wersję i architekturę ( dostarczone przez 'os.uname()'), chociaż dokładna informacja zawarta zależy od systemu operacyjnego; np dla IRIXa architektura nie jest szczególnie istotna (IRIX działa tylko na sprzęcie SGI), ale dla Linuxa wersja jądra nie jest szczególnie istotna.

source: Examples of returned values:
pl: Przykłady zwracanych wartości:

source: For non-POSIX platforms, currently just returns ``sys.platform``.
pl: Dla nie-POSIXowych środowisk/maszyn, obecnie zwraca tylko ``sys.platform``.

source: For Mac OS X systems the OS version reflects the minimal version on which binaries will run (that is, the value of ``MACOSX_DEPLOYMENT_TARGET`` during the build of Python), not the OS version of the current system.
pl: Dla systemów Mac OS X wersja systemu operacyjnego oddaje wersję minimum na której programy będą działać (to jest, wartość ``MACOSX_DEPLOYMENT_TARGET`` w czasie budowy języka pytonowskiego), nie wersja systemu operacyjnego obecnej maszyny/środowiska.

source: For universal binary builds on Mac OS X the architecture value reflects the univeral binary status instead of the architecture of the current processor. For 32-bit universal binaries the architecture is ``fat``, for 64-bit universal binaries the architecture is ``fat64``, and for 4-way universal binaries the architecture is ``universal``. Starting from Python 2.7 and Python 3.2 the architecture ``fat3`` is used for a 3-way universal build (ppc, i386, x86_64) and ``intel`` is used for a univeral build with the i386 and x86_64 architectures
pl: Dla uniwersalnych binarnych budów na Mac OS X wartość architektury oddaje uniwersalny status binarny zamiast architektury obecnego procesora. Dla 32-bitowych uniwersalnych pakietów wykonywalnych architektura jest ``fat`` ( - z ang. - ``gruba``), dla 64-bitowych uniwersalnych pakietów binarnych architektura jest ``fat64``, a dla 4-drożnych uniwersalnych pakietów wykonywalnych architektura jest ``uniwersalna``. Zaczynając od języka pytonowskiego w wersji 2.7 i języka pytonowskiego w wersji 3.2 architektura ``fat3`` jest używana dla 3-drożnego uniwersalnej budowy (ppc, i386, x86_64) i ``intel`` jest używana dla uniwersalnej budowy z architekturami i386 i x86_64.

source: Examples of returned values on Mac OS X:
pl: Przykładami zwracanych wartości na Mac OS X:

source: Return 'pathname' as a name that will work on the native filesystem, i.e. split it on '/' and put it back together again using the current directory separator. Needed because filenames in the setup script are always supplied in Unix style, and have to be converted to the local convention before we can actually use them in the filesystem. Raises :exc:`ValueError` on non-Unix-ish systems if *pathname* either starts or ends with a slash.
pl: Zwróć 'pathname' - 'ścieżkę' jako nazwę, którą będzie pracowała na zastanym systemie plików, tj. rozdzieli je na znaku '/' ukośnika i złoży na powrót używając aktualnego separatora katalogów. Potrzebne ponieważ nazwy plików w skrypcie instalacyjno przygotowawczym są zawsze dostarczane w stylu Unixowym, i musi być konwertowane do lokalnych zwyczajów zanim będzie można właściwie użyć ich w systemie plików. Zgłasza :exc:`ValueError` na nie-Unixowych systemach jeśli *nazwa katalogu* - *pathname* zaczyna się bądź kończy ukośnikiem ( - z ang. - slash)

source: Return *pathname* with *new_root* prepended. If *pathname* is relative, this is equivalent to ``os.path.join(new_root,pathname)`` Otherwise, it requires making *pathname* relative and then joining the two, which is tricky on DOS/Windows.
pl: Zwróć *pathname* ( ścieżkę dostępu ) z *new_root* ( nowym korzeniem ) dopisanym z przodu. Jeśli *nazwaścieżki* ( - z ang. - *pathname*) jest względna, to jest to równoważne ``os.path.join(new_root,pathname)`` W przeciwnym przypadku wymaga uczynienia *nazwyścieżki* względną a potem połączenia obydwu, co może powodować kłopoty w DOS/Windows.

source: Ensure that 'os.environ' has all the environment variables we guarantee that users can use in config files, command-line options, etc. Currently this includes:
pl: Zapewnia że 'os.environ' ma wszystkie zmienne środowiskowe, które gwarantuje się, że użytkownik może użyć w plikach konfiguracyjnych, opcjach wiersza poleceń itp. Obecnie to zawiera:

source: :envvar:`HOME` - user's home directory (Unix only)
pl: :envvar:`HOME` - katalog domowy użytkownika (tylko Unix)

source: :envvar:`PLAT` - description of the current platform, including hardware and OS (see :func:`get_platform`)
pl: :envvar:`PLAT` - opis obecnej maszyny/środowiska, zawierając sprzęt i system operacyjny (zob. :func:`get_platform`)

source: Perform shell/Perl-style variable substitution on *s*. Every occurrence of ``$`` followed by a name is considered a variable, and variable is substituted by the value found in the *local_vars* dictionary, or in ``os.environ`` if it's not in *local_vars*. *os.environ* is first checked/augmented to guarantee that it contains certain values: see :func:`check_environ`. Raise :exc:`ValueError` for any variables not found in either *local_vars* or ``os.environ``.
pl: Wykonaj podstawienie na *s* w stylu Perla/powłoki systemu. Każde wystąpienie ``$`` po którym występuje nazwa jest uważane za zmienną, i zmienna jest podmieniana przez wartość znajdującą się w słowniku *local_vars*, lub w ``os.environ`` jeśli nie jest w *local_vars* ( - z ang. - lokalne zmienne). *os.environ* jest wpierw sprawdzana/wzbogacana aby zagwarantować że zawiera odpowiednie wartości: zobacz :func:`check_environ`. Zgłasza :exc:`ValueError` dla jakichkolwiek zmiennych nie znajdujących się w *local_vars* lub ``os.environ``.

source: Note that this is not a fully-fledged string interpolation function. A valid ``$variable`` can consist only of upper and lower case letters, numbers and an underscore. No { } or ( ) style quoting is available.
pl: Zauważ że to nie jest w-pełni-rozwinięte zadanie rozszerzania ciągów znaków. Prawidłowe ``$variable`` może składać się tylko z liter małych i dużych, cyfr i podkreślnika. Żadne { } ani ( ) cytaty nie są dostępne.

source: Generate a useful error message from an :exc:`EnvironmentError` (:exc:`IOError` or :exc:`OSError`) exception object. Handles Python 1.5.1 and later styles, and does what it can to deal with exception objects that don't have a filename (which happens when the error is due to a two-file operation, such as :func:`rename` or :func:`link`). Returns the error message as a string prefixed with *prefix*.
pl: Generuj użyteczną wiadomość o błędzie z przedmiotu wyjątku :exc:`EnvironmentError` (:exc:`IOError` lub :exc:`OSError`). Obsługuje styl języka pytonowskiego 1.5.1 i późniejszych i robi co się da aby poradzić sobie z przedmiotami sytuacji wyjątkowych, które nie mają nazwy pliku (co się zdarza gdy błąd został spowodowany dwu-plikową operacją, taką jak :func:`rename` albo :func:`link`). Zwraca wiadomość o błędzie jako ciąg znaków z przedrostkiem *prefix*.

source: Split a string up according to Unix shell-like rules for quotes and backslashes. In short: words are delimited by spaces, as long as those spaces are not escaped by a backslash, or inside a quoted string. Single and double quotes are equivalent, and the quote characters can be backslash-escaped. The backslash is stripped from any two-character escape sequence, leaving only the escaped character. The quote characters are stripped from any quoted string. Returns a list of words.
pl: Podziel ciąg znaków zgodnie z Unixowymi zasadami podobnymi-do-powłokowych dotyczącymi cytowania i skośników. Po krótce: słowa są ograniczone spacjami, tak długo jak te spacje nie są poprzedzone przez skośnik, lub wewnątrz cytowanego ciągu znaków. Pojedyncze lub podwójne cytowanie są równoważne i znaki cytowania mogą być poprzedzone skośnikiem. Skośnik jest zdejmowany z każdej dwu-znakowej sekwencji ucieczkowej, zostawiając tylko uciekający znak. Znak cytowania jest zdejmowany z każdego cytowanego ciągu znaków. Zwraca listę słów.

source: Perform some action that affects the outside world (for instance, writing to the filesystem). Such actions are special because they are disabled by the *dry_run* flag. This method takes care of all that bureaucracy for you; all you have to do is supply the function to call and an argument tuple for it (to embody the "external action" being performed), and an optional message to print.
pl: Wykonaj pewne działanie, które wpływa na świat zewnętrzny (np. zapis do systemu plików). Takie działania są szczególne gdyż są zablokowane przez flagę *działania_na_sucho* ( - z ang. - *dry_run*). Ta metoda zajmuje się całą biurokracją za ciebie; wszystko co musisz zrobić to dostarczyć zadanie do wykonania i jego krotkę parametrów dla niego (aby wcielić "zewnętrzną akcję" w trakcie jej wykonania), i nieobowiązkowy komunikat do wypisania.

source: Convert a string representation of truth to true (1) or false (0).
pl: Zamień reprezentację ciągu znaków z prawdy na prawdę (1) lub fałsz (0).

source: True values are ``y``, ``yes``, ``t``, ``true``, ``on`` and ``1``; false values are ``n``, ``no``, ``f``, ``false``, ``off`` and ``0``. Raises :exc:`ValueError` if *val* is anything else.
pl: Wartościami prawdy są ``y``, ``yes``, ``t``, ``true``, ``on`` i ``1``; wartościami fałszu są ``n``, ``no``, ``f``, ``false``, ``off`` i ``0``. Zgłasza :exc:`ValueError` jeśli *val* jest czymkolwiek innym.

source: Byte-compile a collection of Python source files to either :file:`.pyc` or :file:`.pyo` files in the same directory. *py_files* is a list of files to compile; any files that don't end in :file:`.py` are silently skipped. *optimize* must be one of the following:
pl: Kompiluj-bajtowo kolekcję plików źródłowych języka pytonowskiego, aby były :file:`.pyc` lub :file:`.pyo` plikami w tym samym katalogu. *py_files* jest listą plikówdo skompilowania; dowolne pliki które nie kończą się na :file:`.py` są pomijane bez jawnego rozgłaszania. *optymalizuj* musi być jednym z następujących:

source: ``0`` - don't optimize (generate :file:`.pyc`)
pl: ``0`` - nie optymalizuj (generuj :file:`.pyc`)

source: ``1`` - normal optimization (like ``python -O``)
pl: ``1`` - normalna optymalizacja (jak ``python -O``)

source: ``2`` - extra optimization (like ``python -OO``)
pl: ``2`` - extra optymalizacja (jak ``python -OO``)

source: If *force* is true, all files are recompiled regardless of timestamps.
pl: Jeśli *force* jest prawdziwa, wszystkie pliki są ponownie kompilowane niezależnie od stempla czasowego.

source: The source filename encoded in each :term:`bytecode` file defaults to the filenames listed in *py_files*; you can modify these with *prefix* and *basedir*. *prefix* is a string that will be stripped off of each source filename, and *base_dir* is a directory name that will be prepended (after *prefix* is stripped). You can supply either or both (or neither) of *prefix* and *base_dir*, as you wish.
pl: Nazwa pliku źródłowego zakodowana w każdym pliku o kęsowym kodowaniu ( - z ang. - :term:`bytecode`) domyślnie nazwy plików z listy w *py_files*; możesz modyfikować je za pomocą *prefix* i *basedir*. *prefix* jest ciągiem znaków z którego będzie zdjęte każda nazwa pliku źródłowego, a *base_dir* jest nazwą katalogu który będzie doklejony z przodu (po tym, jak *prefix* zostanie zdjęty). Możesz dostarczyć którąkolwiek, albo obie (albo żadną) z *prefix* i *base_dir*, jak sobie życzysz.

source: If *dry_run* is true, doesn't actually do anything that would affect the filesystem.
pl: Jeśli *suchy_start* jest prawdziwy, nie robi nic co mogłoby wpłynąć na system plików.

source: Byte-compilation is either done directly in this interpreter process with the standard :mod:`py_compile` module, or indirectly by writing a temporary script and executing it. Normally, you should let :func:`byte_compile` figure out to use direct compilation or not (see the source for details). The *direct* flag is used by the script generated in indirect mode; unless you know what you're doing, leave it set to ``None``.
pl: Kompilacja-kęsowa jest albo robiona bezpośrednio w procesie programu interpretującego polecenia języka pytonowskiego ze standardowym modułem :mod:`py_compile` albo pośrednio przez zapis tymczasowego skryptu i wykonanie go. Zwykle, powinno się pozwolić zadaniu :func:`byte_compile` odgadnąć czy użyć bezpośredniej kompilacji czy nie (zobacz źródła po szczegóły). Flaga *bezpośrednio* jest używana przez skrypt generowany w trybie pośrednim; z wyjątkiem sytuacji gdy wiesz co robisz, zostaw to ustawienie ustawione na ``None`` ( - z ang. Żaden).

source: Return a version of *header* escaped for inclusion in an :rfc:`822` header, by ensuring there are 8 spaces space after each newline. Note that it does no other modification of the string.
pl: Zwróć wersję *nagłówka* "zauciekniętą" dla włączenia w nagłówek :rfc:`822`, przez zapewnienie że jest 8 spacji miejsca po każdej nowej linii. Zauważ, że nie tworzy to żadnej innej modyfikacji ciągu znaków.

source: :mod:`distutils.dist` --- The Distribution class
pl: :mod:`distutils.dist` --- Uogólnienie dystrybucji

source: This module provides the :class:`Distribution` class, which represents the module distribution being built/installed/distributed.
pl: Ten moduł dostarcza uogólnienie :class:`Distribution`, które reprezentuje dystrybucję modułu w budowie/instalacji/dystrybucji

source: :mod:`distutils.extension` --- The Extension class
pl: :mod:`distutils.extension` --- Klasa rozszerzenia.

source: This module provides the :class:`Extension` class, used to describe C/C++ extension modules in setup scripts.
pl: Ten moduł dostarcza uogólnienie :class:`Extension`, używane do opisu modułów rozszerzających C/C++ w skryptach instalacyjnych.

source: :mod:`distutils.debug` --- Distutils debug mode
pl: :mod:`distutils.debug` --- tryb odpluskwiania distutils

source: This module provides the DEBUG flag.
pl: Ten moduł dostarcza flagę DEBUG.

source: :mod:`distutils.errors` --- Distutils exceptions
pl: :mod:`distutils.errors` --- wyjątki distutils

source: Provides exceptions used by the Distutils modules. Note that Distutils modules may raise standard exceptions; in particular, SystemExit is usually raised for errors that are obviously the end-user's fault (eg. bad command-line arguments).
pl: Dostarcza wyjątki używane przez moduły Distutils. Zauważ, że moduły Distutils mogą zgłaszać standardowe wyjątki; w szczególności SystemExit jest zwykle zgłaszany dla błędów które są w oczywisty sposób z winy użytkownika końcowego (np. nieprawidłowe parametry wywołania z wiersza poleceń).

source: This module is safe to use in ``from ... import *`` mode; it only exports symbols whose names start with ``Distutils`` and end with ``Error``.
pl: Ten moduł jest bezpieczny w użyciu w trybie ``from ... import *``; eksportuje tylko symbole, których nazwy zaczynają się na ``Distutils`` a kończą na ``Error``.

source: :mod:`distutils.fancy_getopt` --- Wrapper around the standard getopt module
pl: :mod:`distutils.fancy_getopt` --- Opakowanie wokół standardowego modułu getopt

source: This module provides a wrapper around the standard :mod:`getopt` module that provides the following additional features:
pl: Ten moduł dostarcza opakowanie wokół standardowego modułu :mod:`getopt` który dostarcza następujące dodatkowe możliwości:

source: short and long options are tied together
pl: krótkie i długie opcje są powiązane razem

source: options have help strings, so :func:`fancy_getopt` could potentially create a complete usage summary
pl: opcje mają ciągi znaków pomocy, więc zadanie :func:`fancy_getopt` może potencjalnie służyć stworzeniu całkowitego podsumowania użytkowania

source: options set attributes of a passed-in object
pl: opcje ustawiają właściwości przekazanego przedmiotu

source: boolean options can have "negative aliases" --- eg. if :option:`--quiet` is the "negative alias" of :option:`--verbose`, then :option:`--quiet` on the command line sets *verbose* to false.
pl: opcje typu boolean (prawda/fałsz) mogą mieć "negatywne aliasy" --- np. jeśli :option:`--quiet` jest "negatywnym aliasem" opcji :option:`--verbose`, wtedy opcja :option:`--quiet` w linii poleceń ustawia tryb *wymowny* (z ang. - *verbose*) na fałsz.

source: **\*\*** Should be replaced with :mod:`optik` (which is also now known as :mod:`optparse` in Python 2.3 and later). **\*\***
pl: **\*\*** Powinno być zastąpione :mod:`optik` (który także teraz znany jest jako :mod:`optparse` w języku pytonowskim w wersji 2.3 i późniejszych). **\*\***

source: Wrapper function. *options* is a list of ``(long_option, short_option, help_string)`` 3-tuples as described in the constructor for :class:`FancyGetopt`. *negative_opt* should be a dictionary mapping option names to option names, both the key and value should be in the *options* list. *object* is an object which will be used to store values (see the :meth:`getopt` method of the :class:`FancyGetopt` class). *args* is the argument list. Will use ``sys.argv[1:]`` if you pass ``None`` as *args*.
pl: Zadanie opakowujące. *options* jest listą ``(long_option, short_option, help_string)`` 3-krotki jak opisano w konstruktorze dla uogólnienia :class:`FancyGetopt`. *negative_opt* powinno być słownikiem mapującym nazwy opcji do nazw opcji, zarówno klucz i wartość powinny być na liście *options*. *object* jest przedmiotem który zostanie użyty aby przechować wartości (zobacz sposób postępowania :meth:`getopt` uogólnienia :class:`FancyGetopt`). *args* jest listą parametrów. Będzie użyte ``sys.argv[1:]`` jeśli przekażesz ``None`` jako *args*.

source: Wraps *text* to less than *width* wide.
pl: Zawija *text* do mniej niż *width* szerokości.

source: The option_table is a list of 3-tuples: ``(long_option, short_option, help_string)``
pl: option_table ( - z ang. - tabela opcji) jest listą 3-krotek: ``(long_option, short_option, help_string)``

source: If an option takes an argument, its *long_option* should have ``'='`` appended; *short_option* should just be a single character, no ``':'`` in any case. *short_option* should be ``None`` if a *long_option* doesn't have a corresponding *short_option*. All option tuples must have long options.
pl: Jeśli opcja bierze parametr, *long_option* ( - z ang. - długa opcja ) powinna mieć ``'='`` doklejona z tyłu; *short_option* ( - z ang. - krótka opcja ) powinna być tylko pojedynczym znakiem, ``':'`` w każdym przypadku *short_option* powinno być ``None`` jeśli *long_option* nie ma odpowiadającego *short_option*. Wszystkie krotki opcji muszą mieć długie opcje.

source: The :class:`FancyGetopt` class provides the following methods:
pl: Uogólnienie :class:`FancyGetopt` dostarcza następujące sposoby postępowania:

source: Parse command-line options in args. Store as attributes on *object*.
pl: Przetwarzaj opcje wiersza-polecenia w args. Zachowaj właściwości w *object*.

source: If *args* is ``None`` or not supplied, uses ``sys.argv[1:]``. If *object* is ``None`` or not supplied, creates a new :class:`OptionDummy` instance, stores option values there, and returns a tuple ``(args, object)``. If *object* is supplied, it is modified in place and :func:`getopt` just returns *args*; in both cases, the returned *args* is a modified copy of the passed-in *args* list, which is left untouched.
pl: Jeśli *args* jest ``None`` lub nie dostarczono, używa ``sys.argv[1:]``. Jeśli *object* jest ``None`` lub nie dostarczono, tworzy nowy przykład uogólnienia :class:`OptionDummy`, zachowuje wartości tam, i zwraca krotę ``(args, object)``. Jeśli *object* jest dostarczony, jest modyfikowany w miejscu i zadanie :func:`getopt` zwraca po prostu *args*; w obu przypadkach, zwracane *args* są zmodyfikowaną kopią przekazanej listy *args*, która pozostawiona jest bez zmian.

source: Returns the list of ``(option, value)`` tuples processed by the previous run of :meth:`getopt` Raises :exc:`RuntimeError` if :meth:`getopt` hasn't been called yet.
pl: Zwraca listę krotek ``(option, value)`` przetworzonych przez poprzednie wykonanie :meth:`getopt`. Zgłasza :exc:`RuntimeError` jeśli :meth:`getopt` nie zostało jeszcze wywołane.

source: Generate help text (a list of strings, one per suggested line of output) from the option table for this :class:`FancyGetopt` object.
pl: Wytwarza tekst pomocy (listę ciągów znaków, jeden na sugerowaną linię wyjścia) z tabeli opcji dla tego przedmiotu :class:`FancyGetopt`.

source: If supplied, prints the supplied *header* at the top of the help.
pl: Jeśli dostarczono, wypisuje dostarczony *nagłówek* ( - z ang. - *header* ) na górze pomocy.

source: :mod:`distutils.filelist` --- The FileList class
pl: :mod:`distutils.filelist` --- uogólnienie FileList
